Revit 2027 API
BuiltInFailures.ElectricalFailures.InvalidNumberOfCircuitValueForDataPanel Property
 The number of circuits on the data panel currently exceeds the value you entered for Maximum Amount of Circuits parameter. Reduce the number of circuits on the equipment before changing this value.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId InvalidNumberOfCircuitValueForDataPanel { get; }
Public Shared ReadOnly Property InvalidNumberOfCircuitValueForDataPanel As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ InvalidNumberOfCircuitValueForDataPanel {
	FailureDefinitionId^ get ();
}
static member InvalidNumberOfCircuitValueForDataPanel : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ElectricalFailures Class
Autodesk.Revit.DB Namespace